In [1]:
import numpy as np
import pandas as pd
from sklearn import linear_model

In [2]:
from word2number import w2n

In [3]:
df = pd.read_csv("C:/Users/HP/Desktop/hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
df.experience = df.experience.fillna('zero')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
for i in range(len(df)):
    df.experience[i] = w2n.word_to_num(df.experience[i])

<ipython-input-5-77839976939b>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.experience[i] = w2n.word_to_num(df.experience[i])

In [6]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2          5                    6.0                           7      60000
3          2                   10.0                          10      65000
4          7                    9.0                           6      70000
5          3                    7.0                          10      62000
6         10                    NaN                           7      72000
7         11                    7.0                           8      80000

In [7]:
import math
median_TScore = math.floor(df[['test_score(out of 10)']].mean())

In [8]:
median_TScore

7

In [9]:
df[['test_score(out of 10)']] = df[['test_score(out of 10)']].fillna(median_TScore)

In [10]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2          5                    6.0                           7      60000
3          2                   10.0                          10      65000
4          7                    9.0                           6      70000
5          3                    7.0                          10      62000
6         10                    7.0                           7      72000
7         11                    7.0                           8      80000

In [11]:
reg = linear_model.LinearRegression()

In [12]:
reg.fit(df[['experience','test_score(out of 10)','test_score(out of 10)']],df[['salary($)']])

LinearRegression()

In [13]:
reg.predict([[2,9,6]])

c:\python39\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[54925.23364486]])

In [14]:
reg.predict([[12,10,10]])

c:\python39\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[88242.99065421]])